
class TermsContent{
  String mainTitle = '이용약관 동의서';
  String allTitle = '모든 약관 동의';

  String privacyTitle = '개인정보 수집 및 이용 동의';
  String privacyMainText =
      '1. 수집·이용하는개인정보 항목\n'+
          ' - 이름\n\n'+

          '2. 개인정보의수집 및 이용목적\n'+
          ' - 개인 식별\n\n'+

          '3. 개인정보의보유 및 이용기간\n'+
          ' - 수집, 이용 및 제공목적이 달성된 경우 [개인정보 보호법] 제21조에 따라 처리동의일로부터 5년 후까지 보관 후 폐기\n\n'+
          '귀하는 이에 대한 동의를 거부할 권리가 있으며. 정보제공을 거부할 경우에는 본 상담 프로그램을 이용하는 것에 제한이 있을 수 있습니다.\n\n';


  String sensitiveTitle = '민감정보 처리에 대한 동의';
  String sensitiveMainText =
      '1. 민감정보의 보유 및 이용기간\n'+
          ' - 동의일로부터 5년 후 까지 보관 후 폐기\n\n'+
          '귀하는 이에 대한 동의를 거부 할 권리가 있으며, 정보제공을 거부할 경우에는 본 상담 프로그램을 이용하는 것에 제한이 있을 수 있습니다.\n\n'
          +'※ 개인정보 제공자가 동의한 내용 외의 다른 목적으로 활용하지 않으며, 제공된 개인정보의 이용을  거부하고자 할 때에는 개인정보 관리책임자를 통해 열람, 정정, 삭제를 요구할 수 있음.\n'
          '⌜개인정보보호법⌟, ⌜동법 시행령⌟, ⌜동법 시행규칙⌟에 의거하여 상기 본인은 위와 같이 개인정보 수집 및 활용에 동의합니다.\n';

  String researchTitle = '제3조(정보주체와 법정대리인의 권리·의무 및 그 행사방법)';
  String researchMainText = '① 정보주체는 옵토스타에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.\n\n'+
      '② 제1항에 따른 권리 행사는 옵토스타에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 옵토스타은(는) 이에 대해 지체 없이 조치하겠습니다.\n\n'+
      '③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.\n'+
      '④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.\n\n'+
      '⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.\n'+
      '⑥ 옵토스타은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.\n\n'+

      '제4조(처리하는 개인정보의 항목 작성)\n'+

      '① < 옵토스타 >은(는) 다음의 개인정보 항목을 처리하고 있습니다.\n'+
      '§ 1< 홈페이지 회원가입 및 관리 >\n'+
      '§ 필수항목 :이름\n'+
      '§ 선택항목 :\n\n'+

      '제5조(개인정보의 파기)\n'+

      '① < 옵토스타 > 은(는) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.\n'+

      '② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.\n'+
      '1. 법령 근거 :\n'+
      '2. 보존하는 개인정보 항목 : 계좌정보, 거래날짜\n'+

      '③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.'
          '1. 파기절차\n'+
      '< 옵토스타 > 은(는) 파기 사유가 발생한 개인정보를 선정하고, < 옵토스타 > 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.\n'+
      '2. 파기방법\n'+
      '전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다\n\n'+

      '제6조(개인정보의 안전성 확보 조치)\n'+

      '< 옵토스타 >은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.\n'+
      '1. 내부관리계획의 수립 및 시행\n'+
      '개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.\n\n'+

      '2. 개인정보에 대한 접근 제한\n'+
      '개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.\n\n'+

      '3. 비인가자에 대한 출입 통제\n'+
      '개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.\n\n'+


      '제7조(개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항)\n\n'+

      '옵토스타 은(는) 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.\n'+
      '제8조 (개인정보 보호책임자)\n'+
      '① 옵토스타 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.\n'+
      '§ ▶ 개인정보 보호책임자\n'+
      '§ 성명 : 심재기\n'+
      '§ 직책 :대표\n'+
      '§ 직급 :대표\n'+
      '§ 연락처 :042-863-1310, customer_cs@optosta.com,\n'+
      '※ 개인정보 보호 담당부서로 연결됩니다.\n'+
      '§ ▶ 개인정보 보호 담당부서\n'+
      '§ 담당자 :심재기\n'+
      '§ 이메일 :customer_cs@optosta.com,\n'+
      '② 정보주체께서는 옵토스타의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 옵토스타 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.\n'+
      '제9조(개인정보 열람청구)\n'+
      '정보주체는 ｢개인정보 보호법｣ 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다.\n'+
      '< 옵토스타 >은(는) 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.\n'+
      '§ ▶ 개인정보 열람청구 접수·처리 부서\n'+
      '§ 담당자 : 심재기\n'+
      '§ 이메일 : customer_cs@optosta.com,\n\n'+

      '제10조(권익침해 구제방법)\n\n'+

      '정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.\n\n'+

      '1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)\n'+
      '2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)\n'+
      '3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)\n'+
      '4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)\n\n'+

      '「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.\n'+

      '※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.\n'+

      '제11조(개인정보 처리방침 변경)\n\n'+

      '① 이 개인정보처리방침은 2024년 05월 30부터 적용됩니다.\n'+
      '② 이전의 개인정보 처리방침은 아래에서 확인하실 수 있습니다.';
}