
class TermsText{
  String mainTitle = '이용약관 동의서';
  String allTitle = '모든 약관 동의';

  String privacyTitle = '개인정보 수집 및 이용 동의';
  String privacyMainText =
  '1. 수집·이용하는개인정보 항목\n'+
  ' - 개인식별 정보(성별, 생년), 근무사항(직무),연락정보(이메일주소)\n\n'+

  '2. 개인정보의수집 및 이용목적\n'+
  ' - 챗봇상담 프로그램 실증사업 이용자 관리\n'
  ' - 참여 비용 지급\n'
  ' - 서비스 만족도조사 및 의견 취합\n\n'+

  '3. 개인정보의보유 및 이용기간\n'+
  ' - 수집, 이용 및 제공목적이 달성된 경우 [개인정보 보호법] 제21조에 따라 처리동의일로부터 5년 후까지 보관 후 폐기\n\n'+
      '귀하는 이에 대한 동의를 거부할 권리가 있으며. 정보제공을 거부할 경우에는 본 상담 프로그램을 이용하는 것에 제한이 있을 수 있습니다.\n\n';


  String sensitiveTitle = '민감정보 처리에 대한 동의';
  String sensitiveMainText =
      '1. 수집·이용하는민감정보 항목\n'+
      ' - 리질리언스 및 번아웃 검사 결과, 챗봇상담 내용 일체, 웨어러블기기를 통해 수집된 신체활동 정보\n\n'+
      '2. 민감정보의 수집및 이용목적\n'+
      ' - 직장인의 리질리언스(회복탄력성) 강화를 위한 AI 기반의 비대면 서비스 개발(효과성 실증)\n\n'+
      '3. 민감정보의 보유 및 이용기간\n'+
      ' - 동의일로부터 5년 후 까지 보관 후 폐기\n\n'+
      '귀하는 이에 대한 동의를 거부 할 권리가 있으며, 정보제공을 거부할 경우에는 본 상담 프로그램을 이용하는 것에 제한이 있을 수 있습니다.\n\n'
          +'※ 개인정보 제공자가 동의한 내용 외의 다른 목적으로 활용하지 않으며, 제공된 개인정보의 이용을   거부하고자 할 때에는 개인정보 관리책임자를 통해 열람, 정정, 삭제를 요구할 수 있음.\n'
          '⌜개인정보보호법⌟, ⌜동법 시행령⌟, ⌜동법 시행규칙⌟에 의거하여 상기 본인은 위와 같이 개인정보 수집 및 활용에 동의합니다.\n';

  String researchTitle = '연구과제 설명 및 참여 동의';
  String researchMainText = '연구과제명 : 건강한 노동력에 기초한 기업과 국가의 경쟁력 제고를 위한 AI기반의 비대면 직장인 리질리언스 강화 서비스 개발\n\n'+
  '본 연구는 직장인의 리질리언스 강화를 위한 AI 기반의 비대면 서비스 개발에 대한 연구입니다. 본 연구에 참여하기에 앞서 설명문과 동의서를 읽어보시고 연구 참여 여부를 자발적으로 결정하실 수 있습니다.'+
      ' 만일 결정에 앞서 어떠한 질문이 있다면 연구원에게 문의하셔서 결정하실 수 있습니다. 이 문서에 대한 귀하의 동의는 귀하가 본 연구에 관한 설명을 들었음을 의미하며, 본 연구에 참가를 자발적으로 희망한다는 것을 의미합니다.\n\n'+
  '1. 연구의 배경과 목적\n'+
  '본 연구는 기존의 직장인 심리지원 서비스(EAP, 대면상담)의 한계, 코로나 팬데믹에 따른 언택트 서비스가 요구되는 상황을 배경으로 하고 있습니다. 본 연구를 통해 AI 기반의 비대면 심리지원 서비스 플랫폼을 개발하여, 직장인 누구나 언제 어디서나 손쉽게 심리지원 받을 수 있도록 하며 리질리언스를 강화할 수 있는 서비스를 제공하고자 합니다. 직원의 건강에 기초한 기업의 생산력 향상과 경쟁력 제고, 나아가 국가 차원에서 정신건강 관리 발전 방안을 모색하는 것을 목표로 하고 있습니다. 귀하가 참여하는 본 과정은 해당 연구의 일환으로 개발 중인 AI 시간의 비대면 서비스의 효과성을 실증하는 연구 단계입니다.\n\n'+
  '2. 연구 참여 대상\n'+
  '본 연구에는 김업 및 영리/비영리 단체에 재직 중인 근로자 100명이 참여할 예정입니다.\n\n'+
  '3. 연구 참여 방법\n'+
  ' - 만일 귀하가 참여의사를 밝혀 주시면 다음과 같이 진행될 것입니다. \n'+
  '  1) 챗봇상담앱 회원가입\n'+
  '  2). 리질리언스, 위기 검사, 번아웃 검사 실시 (개인별 수준에 따라 일부 검사는 선별적 문항 제시)\n'+
  '  3). 검사 결과 확인\n'+
  '  4). 챗봇상담 진행 (상담메뉴 선택)\n'+
  '  5). 리질리언스 사후 검사 실시\n\n'+
  '4.연구 참여 기간\n'+
  ' - 귀하는 본 연구를 위해 리질리언스 및 번아웃 검사(약 5분), 챗봇상담에 60분 참여하도록 요청 받을 것입니다. 참여에 소요되는 시간은 65분으로 예상됩니다.\n\n'
  '5. 연구참여자 준수 사항\n'+
  ' - 리질리언스 및 번아웃 검사 시 떠오르는 대로 솔직하게 응답하여 주시기 바랍니다. 챗봇상담을 60분 이상 참여 후 마지막 검사까지 실시하여 종료 안내 화면을 확인하여 주시기 바랍니다\n\n'+
  '6. 부작용 또는 위험요소\n'+
  ' - 본 연구 수행 중 특별한 위험과 불편감이 예상되지는 않습니다. 연구 참여 도중 어떤 형태로든 부작용이나 위험 요소, 불편감 등에 대한 질문이 있으시면 담당 연구원에게 문의해 주십시오. 연구 수행 중 중단을 원하시면 언제든 중단 의사를 밝혀주신 후 그만둘 수 있습니다. \n\n'+
  '7. 연구 참여에 따른 이익\n'+
  '- 번아웃 검사 결과에 대한 피드백을 제공 받으실 것입니다. 또한 60분간 챗봇상담 참여를 통해 스트레스 경감 및 대처법에 최적화된 상담을 받으실 것입니다. 연구 참여를 통해 연구 참여 목적에 해당하는 과업 수행을 완수(웨어러블 기기 1주일간 착용 및 총 60분간 챗봇상담)을 경우 10만원의 참여비용이 지급될 예정입니다. 또한 심리검사 및 챗봇상담을 통해 자신을 이해하는데 도움이 될 것이며, 사회적으로는 온라인을 통한 심리검사, 상담 서비스를 보편화하고 사람들의 심리건강을 돌보는 데 도움이 될 것입니다.\n\n'+
  '8. 연구에 참여하지 않을 시 불이익\n'+
  '- 귀하는 본 연구에 참여하지 않을 자유가 있습니다. 또한 귀하가 본 연구에 참여하지 않아도 귀하에게는 어떠한 불이익도 없습니다.\n\n'+
  '9. 개인정보와 비밀 보장\n'+
  ' - 본 연구기관은 귀하의 개인정보를 중요시하며 “개인정보보호법”을 준수합니다. 개인정보보호법에 따라 귀하가 제공하는 개인정보가 어떠한 목적으로 이용되는지 알려드리고 정보수집·이용에 대한 동의를 받고 있습니다. (별도의 동의 절차)\n\n'+
  '10. 비밀보장 및 예외 규정\n'+
  ' - 심리검사 및 챗봇상담에서 진행되는 모든 상담내역 및 상담기록은 비밀보장을 원칙으로 하며, 외부로 유출되지 않습니다. 단, 비밀보장 예외 규정에 속하는 경우, 관리자는 참여자의 동의 없이 해당 내용을 관련 기관에 제공할 수 있습니다. (심리상담사 윤리규정에 의거)\n'+
  '  1) 내담자 자신과 타인의 생명, 사회 안전에 위험이 되는 상태라고 판단되는 경우\n'+
  '  2) 내담자가 심각한 학대를 당하고 있을 경우\n'+
  '  3) 법적으로 정보 공개가 요구되는 경우\n'+
  '11. 연구 문의\n'+
      '- 연구담당자 성명: 황희산\n'+
      '- 전화번호: 042-721-2997\n\n'+
      '- 연구담당자 성명: 정희재 \n'+
      '- 전화번호: 070-4888-5434\n\n'+

  '연구과제 주관기관 ㈜온워즈\n'+
  '042-721-2997\n\n'+
  '하기 본인은 이 동의서를 읽고 이해하였으며 모든 질문에 대한 답변을 들었습니다. 이에 본인은 자발적으로 본 연구에 참여함을 동의합니다\n\n';
}