enum AiAnalysisResults {
  /// 만성신장질환
  kidneys(
    '만성 신장 질환은 신장의 기능이 점차적으로 손상되는 질환으로, 초기에는 특별한 증상이 나타나지 않을 수 있지만, 질환의 진행에 따라 다양한 증상이 나타날 수 있습니다. 일반적으로 다음과 같은 증상이 나타날 수 있습니다.',
    '• 소변의 양이 감소하거나 빈도가 증가하는 경우\n• 더 자주 복통이나 허리 통증이 발생하는 경우\n• 두통, 혼동, 혈압상승, 호흡곤란, 발목이 부음 등의 증상이 나타나는 경우\n• 손발이 저리거나 근육 경련 등의 증상이 나타나는 경우\n',

    '만성 신장 질환은 신장의 기능이 점차적으로 손상되는 질환으로, 다양한 원인에 의해 발생할 수 있습니다. 주요한 원인으로는 다음과 같은 질병들이 있습니다.\n',
    '• 당뇨병: 고혈당으로 인해 신장의 혈관과 신장 조직이 손상되는 경우에 발생할 수 있습니다.\n• 고혈압: 고혈압이 지속되면 신장의 혈관이 손상되어 신장 기능이 저하될 수 있습니다.\n• 만성 신염: 장기적으로 발생하는 신염으로, 신장 조직에 손상을 일으켜 신장 기능이 저하될 수 있습니다.\n• 다른 질환에 의한 합병증: 대사성 질환, 면역성 질환, 갑상선 기능저하증, 난치성 질환 등 다양한 질병들이 신장 기능 저하를 유발할 수 있습니다.\n\n',
  ),

  /// 방광염
  bladder(
    '방광염은 방광 내막이 염증을 일으키는 질환으로, 다양한 원인에 의해 발생할 수 있습니다. 주요 증상은 다음과 같습니다.\n',
    '• 자주 소변을 볼 때\n• 급작스럽게 소변을 볼 필요성을 느낄 때\n• 소변을 보는 데에 통증이나 따끔거림을 느낄 때\n• 발열이 동반될 때\n• 이러한 증상이 나타나면 즉시 전문의를 방문하여 치료를 받는 것이 좋습니다.\n',

    '방광염은 방광 내막이 염증을 일으키는 질환으로, 다양한 원인에 의해 발생합니다.\n주로 박테리아나 바이러스에 의한 감염, 알레르기 반응, 자극적인 화학물질에 노출, 방광의 근육 기능 이상 등이 원인이 될 수 있습니다.\n',
    '방광염이 생긴 경우, 미생물이나 알레르기 반응에 의한 경우 등에 따라 다른 질병으로 진행될 가능성도 있습니다.\n예를 들어, 만성 방광염은 장기적인 염증으로 인해 방광 기능에 영향을 미치는데, 이 경우에는 방광암, 방광결석 등의 합병증이 발생할 가능성이 있습니다.\n 따라서, 증상이 나타난 경우 전문의를 방문하여 정확한 진단과 치료가 필요합니다.\n\n',
  ),
  /// 췌장염
  pancreas(
    '췌장염(pancreatitis)은 췌장이 염증을 일으키는 질환으로, 다음과 같은 증상이 나타날 수 있습니다.\n',
    '• 상복부 통증: 상복부에서 시작되어 등 또는 아래배로 퍼질 수 있는 지속적인 심한 통증을 경험할 수 있습니다.\n• 구토: 구토, 소화불량, 메스꺼움 등의 소화기 증상을 경험할 수 있습니다.\n• 체중 감소: 식욕부진, 체중 감소 등의 증상이 나타날 수 있습니다.\n\n- 췌장염은 만성 췌장염과 급성 췌장염으로 나뉘며, 급성 췌장염은 위와 같은 증상이 급격하게 나타나는 경우가 많습니다. 만성 췌장염은 반복적인 급성 췌장염의 경향이 있으며, 복부 통증과 소화기 증상 등이 지속될 수 있습니다. 만약 위와 같은 증상이 나타나면 즉시 의료진과 상담하여 치료를 받아야 합니다.\n\n',

    '췌장염은 췌장의 염증으로 인해 발생하는 질환으로, 다음과 같은 요인이 췌장염의 원인이 될 수 있습니다.\n',
    '• 알코올 소비: 지나친 알코올 소비는 췌장염을 일으킬 수 있습니다.\n• 과도한 지방 섭취: 과도한 지방 섭취는 췌장의 기능을 저하시켜 췌장염을 유발할 수 있습니다.\n• 유전적 요인: 유전적인 요인도 췌장염의 원인이 될 수 있습니다.\n\n',
  ),

  /// 빈혈
  anemia(
    '빈혈의 증상은 빈혈의 원인, 정도, 지속 기간 등에 따라 다양하게 나타날 수 있습니다. 일반적으로 빈혈의 주요 증상은 다음과 같습니다.\n',
    '• 피로감: 쉬지 않아도 지치고 피곤한 느낌이 드는 것으로, 일상생활에서의 활동이나 운동이 힘들어집니다.\n• 식욕 부진: 식욕이 떨어져서 식사량이 감소합니다.\n• 빈맥 등의 피부 변화: 혈액순환에 문제가 생길 경우, 피부에 빈맥 등의 변화가 생길 수 있습니다.\n• 심장 박동 수 증가: 빈혈일 때, 심장은 산소를 더 많이 공급하기 위해 더 빠르게 박동을 하게 됩니다.\n\n',

    '다양한 원인에 의해 빈혈이 발생할 수 있습니다. 일반적으로 빈혈의 원인과 관련된 질병은 다음과 같습니다.\n',
    '• 철분결핍성 빈혈: 철분 섭취 부족이나 흡수 장애, 출혈 등에 의해 철분 부족 상태가 지속되면서 발생하는 빈혈입니다.\n• 비타민 B12 결핍성 빈혈: 위산 부족, 장 질환 등의 원인으로 비타민 B12의 흡수가 잘 이루어지지 않아 발생하는 빈혈입니다.\n• 유전성 빈혈: 유전적으로 적혈구 생성이 불량하거나 소멸이 많아지는 질환으로, 대표적으로 유전성 간질성 빈혈이 있습니다.\n\n',
  ),

  /// 당뇨
  diabetes(
    '당뇨병의 예상 증상은 다음과 같습니다.\n',
    '• 자주 소변을 보게 된다.\n• 목마름을 느끼게 된다.\n• 식욕이 불안정해지거나 급격히 증가하는 경우가 있다.\n• 상처가 잘 나거나, 상처가 난 부위가 느리게 나았다.\n',

    '당뇨병은 자신의 혈당 수치가 계속해서 높아지면서 발생하는 만성질환입니다. 다음과 같은 질병들이 당뇨병의 합병증으로 발생할 수 있습니다.\n',
    '• 심혈관계 질환: 고혈압, 심근경색, 뇌졸중 등이 포함됩니다.\n• 신장 질환: 신부전, 신경병증 등이 있습니다.\n• 시력 손상: 망막병증 등이 있습니다.\n• 발병증: 궤양, 골절 등이 있습니다.\n',
  ),
  /// 신장염
  nephritis(
    '신장염의 예상 증상은 다음과 같을 수 있습니다.\n',
    '• 흔한 증상: 피로감, 체중 감소, 소화 불량, 식욕부진, 복통, 근육 경련 등이 있을 수 있습니다.\n• 배뇨 관련 증상: 소변의 양이 증가하거나 감소할 수 있으며, 자주 배뇨하거나 밤에 잦은 방뇨가 발생할 수 있습니다.\n• 상처가 잘 나거나, 상처가 난 부위가 느리게 나았다.\n',

    '이러한 증상이 나타날 경우 의료진과 상담하여 적절한 진단과 치료를 받아야 합니다. \n',
    '• 신장염이 예상되는 몇 가지 주요 질병들은 다음과 같습니다.\n•신장염이 만성화되면 신장 기능이 점차 저하되고, 신부전으로 진행될 수 있습니다.\n•신장 손상으로 인해 신경계에 영향을 주어 신경병증이 발생할 수 있습니다.\n•신장은 혈압을 조절하는 역할을 합니다. 신장 손상으로 인해 혈압 조절이 어려워지면 고혈압이 발생할 수 있습니다.\n',
  ),
  health(
    '건강검진 요망합니다.',
    '',
    '건강검진 요망합니다.',
    '',
  );

  const AiAnalysisResults(this.symptomTitle, this.symptomContent, this.diseaseTitle, this.diseaseContent);

  // 예상증상
  final String symptomTitle;
  final String symptomContent;

  // 예상질병
  final String diseaseTitle;
  final String diseaseContent;
}